In [2]:
# Let's make a function that takes in a database name as a string
# this function also performs our imports from env
def get_db_url(db_name):
    from env import user, host, password
    return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'

In [3]:
import pandas as pd
import numpy as py

In [4]:
sql = """
    SELECT * from employees limit 3000
"""

In [5]:
# Called the "Connection string" b/c it has all the info to connect
url = get_db_url("employees")

df = pd.read_sql(sql, url)
df

      emp_no  birth_date first_name last_name gender   hire_date
0      10001  1953-09-02     Georgi   Facello      M  1986-06-26
1      10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2      10003  1959-12-03      Parto   Bamford      M  1986-08-28
3      10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4      10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...      ...         ...        ...       ...    ...         ...
2995   12996  1964-12-07     Khalil   Madeira      F  1992-07-14
2996   12997  1956-09-22       Zine     Swist      F  1991-03-22
2997   12998  1956-09-02     Nadjib   Rindone      M  1991-01-23
2998   12999  1963-10-13      Taizo    Koyama      F  1991-11-06
2999   13000  1955-01-31    Adhemar    Chiodo      F  1994-05-11

[3000 rows x 6 columns]

In [ ]:
# Read a CSV from a webpage hosting a CSV
url = "https://gist.githubusercontent.com/ryanorsinger/19bc7eccd6279661bd13307026628ace/raw/e4b5d6787015a4782f96cad6d1d62a8bdbac54c7/lemonade.csv"
lemonade = pd.read_csv(url)
lemonade.head()

In [ ]:
# JSON is short for JavaScript Object Notation
# Cool part is JSON is automatically valid python syntax for: a dictionary or a list of dictionaries
quotes = pd.read_json("https://aphorisms.glitch.me/api/all")
quotes.head()

# Exercises I

# Run python -m pip install pymysql from your terminal to install pymysql.

# Create a notebook or python script named advanced_dataframes to do your work in for these exercises.

# 1. Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)

In [58]:
# pymysql package installed

# 2. cd into your exercises folder for this module and run echo env.py >> .gitignore

In [ ]:
# task completed

# 3. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [59]:
# Let's make a function that takes in a database name as a string
# this function also performs our imports from env
def get_db_url(db_name):
    from env import user, host, password
    return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'

# 4. Use your function to obtain a connection to the employees database.

In [60]:
def get_db_url(employees):
    from env import user, host, password
    return f'mysql+pymysql://{user}:{password}@{host}/{employees}'

In [61]:
url = get_db_url("employees")

df = pd.read_sql(sql, url)
df

      emp_no  birth_date first_name last_name gender   hire_date
0      10001  1953-09-02     Georgi   Facello      M  1986-06-26
1      10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2      10003  1959-12-03      Parto   Bamford      M  1986-08-28
3      10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4      10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...      ...         ...        ...       ...    ...         ...
2995   12996  1964-12-07     Khalil   Madeira      F  1992-07-14
2996   12997  1956-09-22       Zine     Swist      F  1991-03-22
2997   12998  1956-09-02     Nadjib   Rindone      M  1991-01-23
2998   12999  1963-10-13      Taizo    Koyama      F  1991-11-06
2999   13000  1955-01-31    Adhemar    Chiodo      F  1994-05-11

[3000 rows x 6 columns]

# 5. Once you have successfully run a query:

#   a. Intentionally make a typo in the database url. What kind of error message do you see?

#   b. Intentionally make an error in your SQL query. What does the error message look like?

In [1]:
5
 i. ConnectionRefusedError
ii. OperationalError: (2003, "Can't connect to MySQL server on '157.230.209.170' ([Errno 61] Connection refused)")

The above exception was the direct cause of the following exception:

IndentationError: unexpected indent (1715806571.py, line 2)

In [ ]:
5 b. ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'employees.employee' doesn't exist")
[SQL: 
    SELECT * from employee limit 3000
]
(Background on this error at: https://sqlalche.me/e/14/f405)

# 6. Read the employees and titles tables into two separate DataFrames.

In [6]:
sql = """
    SELECT * from employees limit 3000
"""

In [16]:
sql1 ="""
SELECT * FROM titles
"""

In [17]:
url = get_db_url("employees")

df = pd.read_sql(sql, url)
df

      emp_no  birth_date first_name last_name gender   hire_date
0      10001  1953-09-02     Georgi   Facello      M  1986-06-26
1      10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2      10003  1959-12-03      Parto   Bamford      M  1986-08-28
3      10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4      10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...      ...         ...        ...       ...    ...         ...
2995   12996  1964-12-07     Khalil   Madeira      F  1992-07-14
2996   12997  1956-09-22       Zine     Swist      F  1991-03-22
2997   12998  1956-09-02     Nadjib   Rindone      M  1991-01-23
2998   12999  1963-10-13      Taizo    Koyama      F  1991-11-06
2999   13000  1955-01-31    Adhemar    Chiodo      F  1994-05-11

[3000 rows x 6 columns]

In [18]:
url = get_db_url("employees")

new_df = pd.read_sql(sql1, url)
new_df

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

# 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [19]:
df.shape

(3000, 6)

In [21]:
# Row 
df.shape[0]

3000

In [22]:
# Columns
df.shape[1]

6

In [20]:
new_df.shape

(443308, 4)

In [24]:
# Row
new_df.shape[0]

443308

In [25]:
# Columns
new_df.shape[1]

4

# 8. Display the summary statistics for each DataFrame.

In [57]:
new_df.describe

<bound method NDFrame.describe of         emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]>

In [29]:
df.info

<bound method DataFrame.info of       emp_no  birth_date first_name last_name gender   hire_date
0      10001  1953-09-02     Georgi   Facello      M  1986-06-26
1      10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2      10003  1959-12-03      Parto   Bamford      M  1986-08-28
3      10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4      10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...      ...         ...        ...       ...    ...         ...
2995   12996  1964-12-07     Khalil   Madeira      F  1992-07-14
2996   12997  1956-09-22       Zine     Swist      F  1991-03-22
2997   12998  1956-09-02     Nadjib   Rindone      M  1991-01-23
2998   12999  1963-10-13      Taizo    Koyama      F  1991-11-06
2999   13000  1955-01-31    Adhemar    Chiodo      F  1994-05-11

[3000 rows x 6 columns]>

# 9. How many unique titles are in the titles DataFrame?

In [37]:
len(new_df.title.unique())

7

# 10. What is the oldest date in the to_date column?

In [51]:
new_df.to_date.sort_values(ascending = False)

0         9999-01-01
251516    9999-01-01
251529    9999-01-01
251528    9999-01-01
251526    9999-01-01
             ...
277603    1985-04-17
35527     1985-03-23
346216    1985-03-20
406358    1985-03-11
16064     1985-03-01
Name: to_date, Length: 443308, dtype: object

In [52]:
new_df.to_date.sort_values(ascending = False).head(1)

0    9999-01-01
Name: to_date, dtype: object

In [66]:
new_df[new_df.to_date != new_df.to_date.max()].to_date.min()

datetime.date(1985, 3, 1)

# 11. What is the most recent date in the to_date column?

In [62]:
new_df[new_df.to_date != new_df.to_date.max()].to_date.max()

datetime.date(2002, 8, 1)